Documents/ESB/ESB_Consumer_0612/003TestSample/SAMPLE_XML_MUST/RewardPoints/RP10_VndrRwdPntsAwardsAddRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/RewardPoints/VndrRwdPntsAwardsAddRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>RewardPoints</ServiceDomain>  
      <OperationName>VndrRwdPntsAwardsAdd</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:VndrRwdPntsAwardsAddRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>RP10</v11:TxnId>  
        <v11:TxnNo>RP1000001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:VndrName>Test Vender Name</v11:VndrName>  
        <v11:VndrMmbId>AA2468013579</v11:VndrMmbId>  
        <v11:TxnCode>29887923001122334455</v11:TxnCode>  
        <v11:TxnType>3</v11:TxnType>  
        <v11:RwdPnts>300</v11:RwdPnts> 
      </v11:ServiceBody> 
    </v11:VndrRwdPntsAwardsAddRq> 
  </soap:Body> 
</soap:Envelope>
